app/views/quotes/_form.html.erb

SELECT "category_quotes".* FROM "category_quotes" WHERE "category_quotes"."quote_id" = 4
SELECT "categories".* FROM "categories"
---
  <div id="categories-container">
    <% @quote.category_quotes.each do |category_quote| %>

SELECT "categories".* FROM "categories"
---
            <%= ri.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
            <%= ri.select :category_id, Category.all.collect { |cat| [cat.name, cat.id] }, { include_blank: true }, class: "form-control d-inline-block" %>

SELECT "categories".* FROM "categories"
---
// Wait for the document to be fully loaded
document.addEventListener('DOMContentLoaded', function() {
  // Attach an event listener to detect clicks on the "Remove this category" link
  document.addEventListener('click', function(e) {
    if (e.target && e.target.classList.contains('remove-category')) {
      // Prevent the default action of the link
      e.preventDefault();

      // Get all the ingredient fields
      const categoryFields = document.querySelectorAll('.category-field');
      // Only remove an ingredient field if there's more than one
      if (categoryFields.length > 1) {
        e.target.closest('.category-field').remove();
      }
    }
  });
});