app/views/quotes/_quote.html.erb

    <strong>Author:</strong>
    <%= [quote.author.fname, quote.author.lname].compact.join(' ') %>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1 LIMIT 1

<!-- Prevents errors resulting from missing biography -->
<% if quote.biography.present? %>
---
SELECT "biographies".* FROM "biographies" WHERE "biographies"."quote_id" = 8 LIMIT 1