app/views/search/index.html.erb

            <% @quotematch.each do |quote| %>
            <h5 class="text-primary"><%= [quote.author.fname, quote.author.lname].compact.join(' ') %></h5>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1 LIMIT 1