app/views/home/index.html.erb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1 LIMIT 1
---
    <div class="card-body">
        <h4 class="card-title"><%= [quote.author.fname, quote.author.lname].compact.join(' ') %></h4>       <!-- copilot code - How do I access the the name of an author through the foreign key?-->