app/controllers/home_controller.rb

  def index
    @quotes = Quote.where(is_visible: true).take(10)
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_visible" = 1 LIMIT 10