app/controllers/home_controller.rb

  def index
    @quotes = Quote.includes(:categories).take(5)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 2, 3)
SELECT "quotes".* FROM "quotes" LIMIT 5

  def uquotes
    @quotes = Quote.where(user_id: session[:user_id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = 4