app/controllers/quotes_controller.rb

INSERT INTO "authors" ("fname", "lname", "birth_year", "death_year", "created_at", "updated_at") VALUES ('Anonymous', '', NULL, NULL, '2025-10-13 04:03:01.844273', '2025-10-13 04:03:01.844273') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."fname" = 'William' AND "authors"."lname" = 'Shakespeare' AND "authors"."birth_year" = 1564 AND "authors"."death_year" = 1616 LIMIT 1
INSERT INTO "biographies" ("biography", "quote_id", "author_id", "created_at", "updated_at") VALUES ('William Shakespeare was an English playwright, poet and actor. He is widely regarded as the greatest writer in the English language and the world''s pre-eminent dramatist.', 7, 1, '2025-10-13 03:53:07.445751', '2025-10-13 03:53:07.445751') RETURNING "id"
INSERT INTO "quotes" ("quote", "pub_year", "comment", "is_visible", "user_id", "author_id", "created_at", "updated_at") VALUES ('To be or not to be', 1603, 'This is my favourite quote because it is so simple and yet so evocative.', 1, 9, 1, '2025-10-13 03:53:07.433197', '2025-10-13 03:53:07.433197') RETURNING "id", "upload_date"
---
  def create
    author_params = quote_params.delete(:author_attributes)  # Copilot code - How do I check for an existing author before creating one?

    # Copilot code - How do I set the Author's first name to anonymous if the text field is left blank?
    fname = author_params[:fname].to_s.strip.presence || "Anonymous"
    lname = author_params[:lname].to_s.strip.presence

    # Copilot code - How do I check for an existing author before creating one?
    author = Author.find_or_create_by(fname: fname, lname: lname, birth_year: author_params[:birth_year], death_year: author_params[:death_year])
    author.birth_year = author.birth_year.to_i if author.birth_year.present?
    author.death_year = author.death_year.to_i if author.death_year.present?
    author.save if author.new_record? || author.changed?

    @quote = Quote.new(quote_params)
    @quote.author = author  # Copilot code - How do I check for an existing author before creating one?
    @quote.biography.author = author if @quote.biography.present?

    respond_to do |format|
      if @quote.save

DELETE FROM "quotes" WHERE "quotes"."id" = 3
SELECT "authors".* FROM "authors" WHERE "authors"."fname" = 'Yoda' AND "authors"."lname" = '' AND "authors"."birth_year" = NULL AND "authors"."death_year" = NULL LIMIT 1
INSERT INTO "authors" ("fname", "lname", "birth_year", "death_year", "created_at", "updated_at") VALUES ('Yoda', '', NULL, NULL, '2025-10-14 03:34:57.903461', '2025-10-14 03:34:57.903461') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 20 LIMIT 1
SELECT "biographies".* FROM "biographies" WHERE "biographies"."quote_id" = 5 LIMIT 1
UPDATE "quotes" SET "is_visible" = 0, "author_id" = 23, "updated_at" = '2025-10-14 03:34:57.909061' WHERE "quotes"."id" = 17
---
  def update
    # Prevents unauthorised user editing
    if logged_in? && (@quote.user_id == current_user.id || is_administrator?)
      author_params = quote_params.delete(:author_attributes)  # Copilot code - How do I check for an existing author before creating one?

      # Copilot code - How do I set the Author's first name to anonymous if the text field is left blank?
      fname = author_params[:fname]
      fname = "Anonymous" if fname.blank?

      author = Author.find_or_create_by(fname: author_params[:fname], lname: author_params[:lname], birth_year: author_params[:birth_year], death_year: author_params[:death_year]) # Copilot code - How do I check for an existing author before creating one?
      @quote.assign_attributes(quote_params)
      @quote.author = author  # Copilot code - How do I check for an existing author before creating one?
      @quote.biography.author = author if @quote.biography.present?

      respond_to do |format|
        if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = 15
---
  def destroy
    # Prevents unauthorised user deleting
    if logged_in? && (@quote.user_id == current_user.id || is_administrator?)
      @quote.destroy!