app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 1 LIMIT 1
---
    def set_quote
      @quote = Quote.find(params.expect(:id))