app/controllers/quotes_controller.rb

  def create
    author_params = quote_params.delete(:author_attributes)  # Copilot code - How do I check for an existing author before creating one?
    author = Author.find_or_create_by(fname: author_params[:fname], lname: author_params[:lname]) # Copilot code - How do I check for an existing author before creating one?
    @quote = Quote.new(quote_params)
    @quote.author = author  # Copilot code - How do I check for an existing author before creating one?

    respond_to do |format|
      if @quote.save
---
INSERT INTO "quotes" ("quote", "pub_year", "comment", "is_visible", "user_id", "author_id", "created_at", "updated_at") VALUES ('"How strange it is to be anything at all"', NULL, 'Wow. I mean just wow.', 1, 5, 2, '2025-10-07 05:42:20.445017', '2025-10-07 05:42:20.445017') RETURNING "id", "upload_date"

    def set_quote
      @quote = Quote.find(params.expect(:id))
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 2 LIMIT 1