app/controllers/search_controller.rb

  def index
    category_query = params[:category_query]
		if category_query.present?
		  @quotematch = Quote.joins(:category_quotes, :categories).where("categories.name LIKE ?", "%#{category_query}%").distinct
---
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "category_quotes" ON "category_quotes"."quote_id" = "quotes"."id" INNER JOIN "category_quotes" "category_quotes_quotes_join" ON "category_quotes_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "category_quotes_quotes_join"."category_id" WHERE (categories.name LIKE '%philosophy%' AND quotes.is_visible = 1)