app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES ('Thom', 'Yorke', 'ty@radiohead.com', '$2a$12$8BpfImrCo.3zbyaQ9mAd0.UsJsvDtQvtKtOIHoCo4MKMDJqKu6h86', 0, 'Active', '2025-10-07 04:42:30.686860', '2025-10-07 04:42:30.686860') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save